//-------------------------------------------------------------------
// Expresson นิพจน์ คือ ตัวเปร การคำนวณ การเปรียบเทียบ เรียกใช้ฟังก์ชั่น ...
console.log(`10 + 20 = ${10 + 20}`);
// 2/ Loop/Interation/Repeation ทำซ้ำ คือ ทำงานเดิมๆ ซ้ำ
// รู้จำนวนการทำซ้ำ หรือ ไม่รู้จำนวนการทำซ้ำ
// while, do-while, for

let i = 1;
while (i <= 5) {
  //   console.log(i + i + " SAU");
  console.log(`${i} SAU`); //backrick ` Alt+9+6
  i = i + 1; // ++i, i++, i += 1
}
//---------------------------------------------------------
console.log("++++++++++++++++++++++++++++++++++++++++++++++");
let j = 1;
do {
  console.log(`${i} SAU`); //backtick ` Alt+9+6
  j = j + 1; // ++j, j++, j += 1
} while (j <= 5);
//---------------------------------------------------------
console.log("++++++++++++++++++++++++++++++++++++++++++++++");
for (let k = 1; k <= 5; k++) {
  console.log(`${k} SAU`); //backtick ` Alt+9+6
}
